<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_11.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Seleksi Kolom dan Baris Pada Data Frame Menggunakan Loc**

___

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)) ,columns=cols)

df

    A   B   C   D   E
0   2   5  17   8   3
1   4  10   3   6   5
2  12  13  16   8  16
3  14  18  17   7   6
4   6  17  10  19   3
5  17  19   4  10   3
6  18   9  14  14   9
7  12   4   2  17  17
8   5  17  10  14  10
9  11   5   6  11  18

Seleksi Baris dan Kolom menggunakan Loc

In [4]:
#Bagian kiri loc berfungsi mengatur baris
#Bagian kanan loc berfungsi mengatur kolom

df.loc[[0,3,4],['B','E']]

    B  E
0   5  3
3  18  6
4  17  3

Seleksi Baris dengan Kondisi

In [6]:
df.loc[df['B']>10 , ['B','D','E']]
#syarat yang digunakan dimana baris yang diminta adalah kolom B dengan nilai lebih dari 10

    B   D   E
2  13   8  16
3  18   7   6
4  17  19   3
5  19  10   3
8  17  14  10

Slicing Data Frame Menggunakan Loc

In [7]:
df.loc[0:4,'B':'D']

    B   C   D
0   5  17   8
1  10   3   6
2  13  16   8
3  18  17   7
4  17  10  19